Tekla.Structures.Model.ModelObjectExtensions
The Tekla.Structures.Model.ModelObjectExtensions class provides a set of static methods for querying objects that implement Tekla.Structures.Model.Object.
The class also contains methods for hiding and showing Tekla.Structures.Model.ModelObjects.

Tekla.Structures.Model.ModelObjectExtensions.EqualsByIdentifier(Tekla.Structures.Model.Object,Tekla.Structures.Model.Object)
Compares the Tekla.Structures.Model.Object.Identifier with the other Tekla.Structures.Model.Object.
modelObject: The first Tekla.Structures.Model.Object.
other: The Tekla.Structures.Model.Object to compare the Tekla.Structures.Model.Object.Identifier with.
Returns: True if the identifiers are equal; otherwise, false.

Tekla.Structures.Model.ModelObjectExtensions.GetExtrema(Tekla.Structures.Model.CustomPart,Tekla.Common.Geometry.Vector3@,Tekla.Common.Geometry.Vector3@)
Gets the extrema of the custom part. These are in the custom parts own coordinate system,
since the extrema of the custom part type would be meaningless in locals.
target: The target custom part.
minPoint: The minimum point of the extrema.
maxPoint: The maximum point of the extrema.
Returns:
True if the extrema was successfully retrieved, otherwise false.
Throws System.ArgumentNullException: target

Tekla.Structures.Model.ModelObjectExtensions.GetAppliedAttributes(Tekla.Structures.Model.BaseComponent)
Gets the applied attributes for a given object type.
baseComponent: The object type.
Returns: A dictionary of applied attribute names/values.

Tekla.Structures.Model.ModelObjectExtensions.SetAppliedAttributes(Tekla.Structures.Model.BaseComponent,System.Collections.Generic.Dictionary{System.String,System.Object})
Sets the applied attributes for a given object type.
baseComponent: The object type.
attributes: The attributes to set.
Returns: A System.Boolean indicating whether the setting succeeded.

Tekla.Structures.Model.ModelObjectExtensions.SetConnectedFaces(Tekla.Structures.Model.ModelObject,Tekla.Structures.Model.ModelObject,System.Collections.Generic.ICollection{Tekla.BIM.Geometry.Face3})
Sets the faces which are connected to the model object as the references.
modelObject: The target model object which owns the connection.
connectedObject: The part containing the faces which are connected to the owning model object.
faces: The connected faces.
Returns: True if the connection is successfully created; otherwise, false.

Tekla.Structures.Model.ModelObjectExtensions.GetConnectedFaces(Tekla.Structures.Model.ModelObject)
Gets the faces which are connected to the model object as the references.
modelObject: The target model object which owns the connection.
Returns: The key/value pair of the owning object ID and the list of Tekla.BIM.Geometry.Face3.

Tekla.Structures.Model.ModelObjectExtensions.IsParentOfAny(Tekla.Structures.Model.ModelObject,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject})
Determines whether the modelObject is the parent of any object in the targetObjects.
modelObject: The given model object.
targetObjects: The target model objects.
Returns: True if the modelObject is the parent of any object in the targetObjects.

Tekla.Structures.Model.ModelObjectExtensions.GetInputPoints(Tekla.Structures.Model.CutPlane)
Gets the input points of the cutPlane.
cutPlane: The cut plane.
Returns: The input points of the cutPlane.

Tekla.Structures.Model.ModelObjectExtensions.SetInputPoints(Tekla.Structures.Model.CutPlane,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Vector3)
Sets the input points of the cutPlane based on the absolute coordinates.
cutPlane: The cut plane.
origin: The origin.
x: The axis x coordinate.
y: The axis y coordinate.

Tekla.Structures.Model.ModelObjectExtensions.SetInputPoints(Tekla.Structures.Model.CutPlane,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Sets the input points of the cutPlane based on the absolute coordinates.
cutPlane: The cut plane.
origin: The origin.
x: The axis x coordinate.
y: The axis y coordinate.

Tekla.Structures.Model.ModelObjectExtensions.IsLocked(Tekla.Structures.Model.ModelObject)
Determines whether the modelObject is locked.
modelObject: The model object.
Returns: true if the modelObject is locked; otherwise, false.

Tekla.Structures.Model.ModelObjectExtensions.Highlight(Tekla.Structures.Model.ModelObject)
Highlights the specified model object.
modelObject: The model object.
Returns: True on success; otherwise, false.

Tekla.Structures.Model.ModelObjectExtensions.Unhighlight(Tekla.Structures.Model.ModelObject)
Unhighlights the specified model object.
modelObject: The model object.
Returns: True on success; otherwise, false.

Tekla.Structures.Model.ModelObjectExtensions.GetCircle(Tekla.Structures.Model.ControlCircle)
Gets a Tekla.Common.Geometry.Circle3 from the controlCircle
controlCircle: The control circle.
Returns: The circle.

Tekla.Structures.Model.ModelObjectExtensions.GetArc(Tekla.Structures.Model.ControlArc)
Gets a Tekla.Common.Geometry.Arc3 from the controlArc
controlArc: The control arc.
Returns: The arc.

Tekla.Structures.Model.ModelObjectExtensions.SetHiddenState(Tekla.Structures.Model.ModelObject,System.Boolean)
Sets the temporary hidden state of the model object.
modelObject: The model object.
isHidden: The new hidden state.
Returns: True on success. Otherwise, returns false.

Tekla.Structures.Model.ModelObjectExtensions.CleanShapeFromSolidCache(System.String)
Clean solid cache with the given shape GUID in order that
solid creation with new shape will take place to all instances later.
shapeGuid: The GUID of modified shape.
Returns: True on success. Otherwise, returns false.

Tekla.Structures.Model.ModelObjectExtensions.TryGetClosestEdge(Tekla.Structures.Model.ModelObject,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Segment3@,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Tries to resolve the closest line on modelObject to point.
modelObject: The Tekla.Structures.Model.ModelObject.
point: The point to get the closest line to.
closestEdge: The closest line of modelObject.
viewData: The view data associated with the modelObject.
Returns: True if modelObject defines resolvable lines; otherwise, false.

Tekla.Structures.Model.ModelObjectExtensions.TryGetClosestFace3(Tekla.Structures.Model.ModelObject,Tekla.Common.Geometry.UnitVector3,Tekla.Common.Geometry.Vector3,Tekla.BIM.Geometry.Face3@,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Tries to resolve the closest face on modelObject to point.
modelObject: The tolerated Tekla.Structures.Model.ModelObject.
pointNormal: The normal of the point.
point: The hit point on the tolerated object.
closestFace: The closest face of modelObject.
viewData: The view data associated with the modelObject.
Returns: True if modelObject defines resolvable faces; otherwise, false.

Tekla.Structures.Model.ModelObjectExtensions.GetIdentifier(System.Object)
Gets the identifier from the target.
target: The target.
Returns: The identifier from the target, if any.

Tekla.Structures.Model.ModelObjectExtensions.AssertUnavailableGeometry(Tekla.Structures.Model.ModelObject)
Asserts the case where there geometrical data for modelObject is unavailable.
The assertion is only made in debug builds.
Throws System.NotImplementedException:
A System.NotImplementedException is thrown if geometrical data for modelObject is expected to be available.
modelObject: The Tekla.Structures.Model.ModelObject to assert unavailable geometrical data for.

Tekla.Structures.Model.ModelObjectExtensions.ToIEnumerable(Tekla.Structures.Model.ModelObjectEnumerator)
Converts a ModelObjectEnumerator to an IEnumerable.
enumerator: The ModelObjectEnumerator.
Returns: The IEnumerable.